---
kind: method
id: M:Autodesk.Revit.DB.ParameterValueProvider.#ctor(Autodesk.Revit.DB.ElementId)
source: html/85fbefcc-4e26-dfdd-2f2c-d767978602f9.htm
---
# Autodesk.Revit.DB.ParameterValueProvider.#ctor Method

Constructs an instance of ParameterValueProvider.

## Syntax (C#)
```csharp
public ParameterValueProvider(
	ElementId parameter
)
```

## Parameters
- **parameter** (`Autodesk.Revit.DB.ElementId`) - The parameter used to provide a string, integer, and double-precision, or ElementId
 value on request for a given element.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null